app/views/classrooms/new.html.erb

SELECT `schools`.* FROM `schools`
---
          <td>
             <%= select_tag 'classroom[school_id]', options_from_collection_for_select(School.all, :id, :name) %>