app/views/students/edit.html.erb

	            <td>
	               <%= select_tag 'student[school_id]', options_from_collection_for_select(School.all, :id, :name) %>
---
SELECT `schools`.* FROM `schools`

	            <td>
	              <%= select_tag 'student[classroom_id]', options_from_collection_for_select(Classroom.all, :id, :name) %>
---
SELECT `classrooms`.* FROM `classrooms`