app/views/students/new.html.erb

SELECT `schools`.* FROM `schools`
---
            <td>
               <%= select_tag 'student[school_id]', options_from_collection_for_select(School.all, :id, :name) %>

SELECT `classrooms`.* FROM `classrooms`
---
            <td>
              <%= select_tag 'student[classroom_id]', options_from_collection_for_select(Classroom.all, :id, :name) %>