app/views/teachers/edit.html.erb

SELECT `classrooms`.id FROM `classrooms` INNER JOIN `classrooms_teachers` ON `classrooms`.`id` = `classrooms_teachers`.`classroom_id` WHERE `classrooms_teachers`.`teacher_id` = ?  [["teacher_id", 1]]
---
            <td>
              <%= select_tag 'teacher[classroom_ids]', options_from_collection_for_select(Classroom.all, :id, :name,:selected=>@teacher.classrooms.collect(&:id)),
              { :multiple => true }%>

SELECT `subjects`.* FROM `subjects` INNER JOIN `subjects_teachers` ON `subjects`.`id` = `subjects_teachers`.`subject_id` WHERE `subjects_teachers`.`teacher_id` = ?  [["teacher_id", 1]]
---
	 			<td>
	 				 <%= select_tag 'teacher[subject_ids]', options_from_collection_for_select(Subject.all, :id, :name,:selected=>@teacher.subjects.collect(&:id)), { :multiple => true }%>