app/views/teachers/edit.html.erb

	          <td>
	             <%= select_tag 'teacher[school_id]', options_from_collection_for_select(School.all, :id, :name) %>
---
SELECT `schools`.* FROM `schools`