app/views/teachers/new.html.erb

            <td>
               <%= select_tag 'teacher[school_id]', options_from_collection_for_select(School.all, :id, :name) %>
---
SELECT `schools`.* FROM `schools`

            <td>
              <%= select_tag 'teacher[classroom_ids]', options_from_collection_for_select(Classroom.all, :id, :name),
              { :multiple => true, :size =>3 } %>
---
SELECT `classrooms`.* FROM `classrooms`

        <td>
         <%= select_tag 'teacher[subject_ids]', options_from_collection_for_select(Subject.all, :id, :name),
              { :multiple => true, :size =>3 } %>
---
SELECT `subjects`.* FROM `subjects`