app/views/teachers/show.html.erb

SELECT `subjects`.* FROM `subjects` INNER JOIN `subjects_teachers` ON `subjects`.`id` = `subjects_teachers`.`subject_id` WHERE `subjects_teachers`.`teacher_id` = ?  [["teacher_id", 2]]
---
		<td>
			<%= @teacher.subjects.collect(&:name).join(",")%>

SELECT `classrooms`.* FROM `classrooms` INNER JOIN `classrooms_teachers` ON `classrooms`.`id` = `classrooms_teachers`.`classroom_id` WHERE `classrooms_teachers`.`teacher_id` = ?  [["teacher_id", 2]]
---
		<td>
			<%= @teacher.classrooms.collect(&:name).join(",")%>