app/controllers/classrooms_controller.rb

SELECT `classrooms`.* FROM `classrooms`
---
	def index
		@classrooms=Classroom.all

SELECT  `classrooms`.* FROM `classrooms` WHERE `classrooms`.`id` = ? LIMIT 1  [["id", 2]]
---
	def show
		begin
		@classroom = Classroom.find(params[:id])

SELECT  `classrooms`.* FROM `classrooms` WHERE `classrooms`.`id` = ? LIMIT 1  [["id", 1]]
---
	 def edit
	 	@classroom = Classroom.find(params[:id])

INSERT INTO `classrooms` (`name`, `number_of_students`, `school_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["name", "BCA"], ["number_of_students", "55"], ["school_id", 1], ["created_at", "2016-09-24 09:28:26"], ["updated_at", "2016-09-24 09:28:26"]]
---
	def create
# //Teacher.new(params.require(:teacher).permit(:name,  :gender, :phone_no,
# :school_id).merge(:classroom_ids=>params[:teacher][:classroom_ids],:subject_ids=>params[:teacher][:subject_ids]))
		 @classroom = Classroom.new(params.require(:classroom).permit(:name, :number_of_students, :school_id).merge(:subject_ids=>params[:classroom][:subject_ids]))
		 if @classroom.save

SELECT  `classrooms`.* FROM `classrooms` WHERE `classrooms`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `classrooms` SET `number_of_students` = ?, `updated_at` = ? WHERE `classrooms`.`id` = ?  [["number_of_students", "24"], ["updated_at", "2016-09-24 09:19:53"], ["id", 1]]
---
	def update
		begin
		@classroom = Classroom.find(params[:id])
		if @classroom.update_attributes(params.require(:classroom).permit(:name,
			:number_of_students, :school_id).merge(:subject_ids=>params[:classroom][:subject_ids]))

SELECT  `classrooms`.* FROM `classrooms` WHERE `classrooms`.`id` = ? LIMIT 1  [["id", 1]]
DELETE FROM `classrooms` WHERE `classrooms`.`id` = ?  [["id", 1]]
SELECT `classrooms`.* FROM `classrooms`
---
	def destroy
		begin
		@classroom = Classroom.find(params[:id])
	   if @classroom.destroy
	   	@classrooms = Classroom.all