app/controllers/schools_controller.rb

SELECT `schools`.* FROM `schools`
---
	def index
		@schools=School.all

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = ? LIMIT 1  [["id", 1]]
---
	def show
		begin
		@school = School.find(params[:id])

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = ? LIMIT 1  [["id", 1]]
---
	 def edit
	 	@school = School.find(params[:id])

INSERT INTO `schools` (`name`, `address`, `city`, `zipcode`, `state`, `phone_no`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@school = School.new(school_param)

		if @school.save

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `schools` SET `address` = ?, `updated_at` = ? WHERE `schools`.`id` = ?  [["address", "hiram mangri sec-7"], ["updated_at", "2016-09-23 12:15:48"], ["id", 1]]
---
	def update
		begin
			@school = School.find(params[:id])
			if @school.update_attributes(school_param)

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = ? LIMIT 1  [["id", 1]]
DELETE FROM `schools` WHERE `schools`.`id` = ?  [["id", 1]]
SELECT `schools`.* FROM `schools`
---
	def destroy
		begin
		@school = School.find(params[:id])

	   		if @school.destroy
	   			@schools = School.all