app/controllers/students_controller.rb

	def show
		begin
		@student=Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = ? LIMIT 1  [["id", 1]]

	def create
		@student = Student.new(student_param)

		if @student.save
---
INSERT INTO `students` (`name`, `father_name`, `mother_name`, `phone_no`, `address`, `city`, `zipcode`, `state`, `school_id`, `classroom_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def destroy
		p params[:id]
		begin
			@student=Student.find(params[:id])

			if @student.destroy
				@students = Student.all
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = ? LIMIT 1  [["id", 2]]
DELETE FROM `students` WHERE `students`.`id` = ?  [["id", 2]]
SELECT `students`.* FROM `students`