app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects`
---
	def index
		@subjects=Subject.all

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = ? LIMIT 1  [["id", 1]]
---
	def show
		begin
		@subject=Subject.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = ? LIMIT 1  [["id", 1]]
---
	def edit
	 	@subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `created_at`, `updated_at`) VALUES (?, ?, ?)  [["name", "RAILS"], ["created_at", "2016-09-24 18:26:56"], ["updated_at", "2016-09-24 18:26:56"]]
---
	def create
		@subject=Subject.new(subject_param)
		if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `subjects` SET `name` = ?, `updated_at` = ? WHERE `subjects`.`id` = ?  [["name", "RAILS"], ["updated_at", "2016-09-24 18:25:57"], ["id", 1]]
---
	def update
		begin
		@subject=Subject.find(params[:id])
		if @subject.update_attributes(subject_param)

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = ? LIMIT 1  [["id", 1]]
DELETE FROM `subjects` WHERE `subjects`.`id` = ?  [["id", 1]]
---
	def destroy
		begin
		@subject=Subject.find(params[:id])
		if @subject.destroy