app/controllers/teachers_controller.rb

SELECT `teachers`.* FROM `teachers`
---
	def index
		@teachers=Teacher.all

SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = ? LIMIT 1  [["id", 1]]
---
	def show
		begin
		@teacher =Teacher.find(params[:id])

SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = ? LIMIT 1  [["id", 1]]
---
	def edit
	 	@teacher = Teacher.find(params[:id])

INSERT INTO `teachers` (`name`, `gender`, `phone_no`, `school_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sanjana"], ["gender", "Male"], ["phone_no", "7834984384"], ["school_id", 1], ["created_at", "2016-09-25 16:03:33"], ["updated_at", "2016-09-25 16:03:33"]]
---
	def create

		# @teacher=Teacher.new(teacher_param)
		@teacher = Teacher.new(params.require(:teacher).permit(:name, :proficiency_subject, :gender, :phone_no, :school_id).merge(:classroom_ids=>params[:teacher][:classroom_ids]))

		if @teacher.save

SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `teachers` SET `proficiency_subject` = ?, `gender` = ?, `school_id` = ?, `updated_at` = ? WHERE `teachers`.`id` = ?  [["proficiency_subject", "English"], ["gender", "Male"], ["school_id", 1], ["updated_at", "2016-09-24 10:09:05"], ["id", 3]]
---
	def update
		begin
		@teacher=Teacher.find(params[:id])
		if @teacher.update_attributes(teacher_param)

SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = ? LIMIT 1  [["id", 1]]
DELETE FROM `teachers` WHERE `teachers`.`id` = ?  [["id", 1]]
---
	def destroy
		begin
		@teacher=Teacher.find(params[:id])
		if @teacher.destroy